updateStatus = function(status) {
    $("#status").text(status);
}

findAppointments = async function() {
    updateStatus("מחפש...");
    const maxNearestLocations = 5;
    let lat = parseFloat($("#lat").val());
    let lng = parseFloat($("#lng").val());
    let auth = $("#jwt").val();
    let locations = await axios.post('http://localhost:8080/locations', {
        maxNearestLocations,
        lat,
        lng
    });
    const locNames = locations.data.map(l => l.LocationName);
    updateStatus(`מחפש בלשכות הבאות: ${locNames.join(",")}`);
    let data = await axios.post('http://localhost:8080/appointments', {
        "locations": locations.data,
        "jwt": auth,
    });
    debugger;
}
 
function getPosition(options) {
    return new Promise((resolve, reject) => 
        navigator.geolocation.getCurrentPosition(resolve, reject, options)
    );
}

async function getCurrentLocation() {
    return;
    var geoOptions = {
        enableHighAccuracy: true,
        timeout: 5000,
        maximumAge: 0
    };
    let data;
    const pos = await getPosition(geoOptions);
    const mapUrl = `https://www.mapquestapi.com/geocoding/v1/reverse?key=IkcEuF1QqyNeGJiTzzMSMtztCFG4A93V&location=${pos.coords.latitude}%2C${pos.coords.longitude}&outFormat=json&thumbMaps=false`
    data = await axios.get(mapUrl);
    data = data.data;
    if (data && data.results && data.results.length > 0 && data.results[0].locations && data.results[0].locations.length > 0) {
        const loc = data.results[0].locations[0];
        return {"city": loc.adminArea5, "street": loc.street, "lat": pos.coords.latitude, "lng": pos.coords.longitude};
    };
}

function prettyDate(date) {
    return date.split("T")[0];
}

function addDateToTable(loc, date, slots) {
    $("#slots").append(`<tr><td>${loc}</td><td>${prettyDate(date)}</td><td>${slots.join(" ")}</td></tr>`);
}

function addSlotsToTable() {
    data = [
        {
            "location": "לשכת טייבה",
            "date": "2022-06-28T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-28T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-28T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-28T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-28T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-28T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-28T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-28T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-28T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-29T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-29T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-06-30T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-03T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-03T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-03T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-03T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-03T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "14:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "14:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "14:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "15:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "15:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "16:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "16:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-04T00:00:00",
            "hour": "16:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-05T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-06T00:00:00",
            "hour": "14:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-06T00:00:00",
            "hour": "14:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-06T00:00:00",
            "hour": "14:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-06T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-06T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-06T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-06T00:00:00",
            "hour": "15:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-06T00:00:00",
            "hour": "15:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-06T00:00:00",
            "hour": "16:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-06T00:00:00",
            "hour": "16:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-06T00:00:00",
            "hour": "16:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-06T00:00:00",
            "hour": "16:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-07T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-17T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "14:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "14:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "14:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "15:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "15:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "16:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "16:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "16:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-18T00:00:00",
            "hour": "16:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-19T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-20T00:00:00",
            "hour": "14:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-20T00:00:00",
            "hour": "14:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-20T00:00:00",
            "hour": "14:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-20T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-20T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-20T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-20T00:00:00",
            "hour": "15:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-20T00:00:00",
            "hour": "15:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-20T00:00:00",
            "hour": "16:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-20T00:00:00",
            "hour": "16:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-20T00:00:00",
            "hour": "16:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-20T00:00:00",
            "hour": "16:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-21T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-24T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "14:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "14:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "14:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "15:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "15:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "16:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "16:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "16:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-25T00:00:00",
            "hour": "16:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-26T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-27T00:00:00",
            "hour": "14:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-27T00:00:00",
            "hour": "14:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-27T00:00:00",
            "hour": "14:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-27T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-27T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-27T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-27T00:00:00",
            "hour": "15:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-27T00:00:00",
            "hour": "15:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-27T00:00:00",
            "hour": "16:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-27T00:00:00",
            "hour": "16:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-27T00:00:00",
            "hour": "16:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-27T00:00:00",
            "hour": "16:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-07-28T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "14:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "14:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "14:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "15:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "15:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "16:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "16:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "16:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-01T00:00:00",
            "hour": "16:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-02T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-03T00:00:00",
            "hour": "14:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-03T00:00:00",
            "hour": "14:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-03T00:00:00",
            "hour": "14:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-03T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-03T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-03T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-03T00:00:00",
            "hour": "15:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-03T00:00:00",
            "hour": "15:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-03T00:00:00",
            "hour": "16:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-03T00:00:00",
            "hour": "16:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-03T00:00:00",
            "hour": "16:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-03T00:00:00",
            "hour": "16:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-04T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "14:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "14:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "14:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "15:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "15:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "16:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "16:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "16:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-08T00:00:00",
            "hour": "16:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-09T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-10T00:00:00",
            "hour": "14:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-10T00:00:00",
            "hour": "14:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-10T00:00:00",
            "hour": "14:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-10T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-10T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-10T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-10T00:00:00",
            "hour": "15:42"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-10T00:00:00",
            "hour": "15:54"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-10T00:00:00",
            "hour": "16:6"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-10T00:00:00",
            "hour": "16:18"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-10T00:00:00",
            "hour": "16:30"
        },
        {
            "location": "לשכת טייבה",
            "date": "2022-08-10T00:00:00",
            "hour": "16:42"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-26T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-28T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-07-31T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "14:30"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "14:42"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "14:54"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "15:42"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "15:54"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-01T00:00:00",
            "hour": "16:18"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "15:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "15:10"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "15:20"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "15:40"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "15:50"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "16:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-02T00:00:00",
            "hour": "16:10"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-03T00:00:00",
            "hour": "14:42"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-03T00:00:00",
            "hour": "14:54"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-03T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-03T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-03T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-03T00:00:00",
            "hour": "15:42"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-03T00:00:00",
            "hour": "15:54"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-03T00:00:00",
            "hour": "16:6"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-03T00:00:00",
            "hour": "16:18"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-03T00:00:00",
            "hour": "16:30"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-04T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "14:30"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "14:42"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "14:54"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "15:42"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "15:54"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "16:6"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "16:18"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "16:30"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-08T00:00:00",
            "hour": "16:42"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "8:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "8:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "8:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "8:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "8:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "9:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "9:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "9:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "9:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "9:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "10:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "10:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "10:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "10:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "10:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "11:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "11:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "11:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "11:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "11:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "12:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "12:12"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "12:24"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "12:36"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "12:48"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "15:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "15:10"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "15:20"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "15:40"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "15:50"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "16:0"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "16:10"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "16:20"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "16:30"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "16:40"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-09T00:00:00",
            "hour": "16:50"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-10T00:00:00",
            "hour": "14:30"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-10T00:00:00",
            "hour": "14:42"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-10T00:00:00",
            "hour": "14:54"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-10T00:00:00",
            "hour": "15:6"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-10T00:00:00",
            "hour": "15:18"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-10T00:00:00",
            "hour": "15:30"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-10T00:00:00",
            "hour": "15:42"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-10T00:00:00",
            "hour": "15:54"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-10T00:00:00",
            "hour": "16:6"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-10T00:00:00",
            "hour": "16:18"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-10T00:00:00",
            "hour": "16:30"
        },
        {
            "location": "לשכת נתניה",
            "date": "2022-08-10T00:00:00",
            "hour": "16:42"
        }
    ];
    if (!data) {
        return;
    }
    let mapped = {};
    data.forEach((o) => {
        let key = JSON.stringify({"location": o.location, "date": o.date});
        if (!mapped[key]) {
            mapped[key] = [ `${o.hour}` ];
        } else {
            mapped[key].push(`${o.hour}`);
        }
    });
    Object.keys(mapped).forEach((k) => {
        const key = JSON.parse(k);
        const val = mapped[k];
        addDateToTable(key.location, key.date, val);
    });
}